{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "angry",
    "1": "anxious",
    "2": "calm",
    "3": "energetic",
    "4": "excited",
    "5": "focused",
    "6": "frustrated",
    "7": "hopeful",
    "8": "joy",
    "9": "neutral",
    "10": "passionate",
    "11": "sad",
    "12": "thoughtful"
  },
  "initializer_range": 0.02,
  "label2id": {
    "angry": 0,
    "anxious": 1,
    "calm": 2,
    "energetic": 3,
    "excited": 4,
    "focused": 5,
    "frustrated": 6,
    "hopeful": 7,
    "joy": 8,
    "neutral": 9,
    "passionate": 10,
    "sad": 11,
    "thoughtful": 12
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.2",
  "vocab_size": 30522
}
